import sqlite3

conn = sqlite3.connect("event_db.sqlite")
cursor = conn.cursor()

cursor.executescript(
    '''
        INSERT INTO room (room_name, room_capacity)
        VALUES 
            ('D752', 100),
            ('D738', 100),
            ('Синие ковры', 75),
            ('Колонный зал', 50),
            ('Морской зал', 300),
            ('Синий зал', 900),
            ('B627', 35),
            ('D542', 100),
            ('B 5 этаж', 200)
    '''
)

cursor.executescript (
    '''
        INSERT INTO role (role_name)
        VALUES 
            ('Докладчик'),
            ('Ведущий'),
            ('Волонтер'),
            ('Фотограф'),
            ('Организатор')
    '''
)

cursor.executescript (
    '''
        INSERT INTO worker (worker_id, worker_name, role_id)
        VALUES
            ('89140000001', 'Доржиев А.С.', 1),
            ('89140000002', 'Жигжитов Э.А.', 2),
            ('89140000003', 'Аюров Р.С.', 3),
            ('89140000004', 'Борщевский И.О.', 4),
            ('89140000005', 'Пяткин А.В.', 5),
            ('89140000006', 'Федоров А.М.', 1),
            ('89140000007', 'Чемериская Е.В.', 2),
            ('89140000008', 'Широкова С.С.', 3),
            ('89140000009', 'Корогод Д.А.', 4),
            ('89140000010', 'Лысенко А.А.', 5),
            ('89140000011', 'Перфильева Д.В.', 1),
            ('89140000012', 'Полянская Е.О.', 2),
            ('89140000013', 'Бройко О.С.', 3),
            ('89140000014', 'Мищенко А.А.', 4),
            ('89140000015', 'Седых А.Н.', 5),
            ('89140000016', 'Сусоева А.Д.', 1),
            ('89140000017', 'Шулятьев А.А.', 2),
            ('89140000018', 'Худоногов С.В.', 3),
            ('89140000019', 'Шулятьев А.А.', 4),
            ('89140000020', 'Фролов А.А.', 5),
            ('89140000021', 'Орлов Г.А.', 3),
            ('89140000022', 'Паркеров П.Б.', 3),
            ('89140000023', 'Моралез М.Д.', 3),
            ('89140000024', 'Пушкин А.С.', 3),
            ('89140000025', 'Иванов В.В.', 3),
            ('89140000026', 'Шепелев А.А.', 3),
            ('89140000027', 'Джеймесон Д.Д.', 4),
            ('89140000028', 'Петров П.П.', 4),
            ('89140000029', 'Гузеева А.А.', 4)
    '''
)

cursor.executescript (
    '''
        INSERT INTO event (event_name, people_amount)
        VALUES 
            ('Экзекуция инженеров', 100),
            ('Посвящение в студенты ИМиКТ', 500),
            ('Ежегодная конференция МООН', 150),
            ('Выпускной ИМиКТ', 900),
            ('Посвящение в студенты ШЭМ', 600),
            ('Посвящение в студенты ИМО', 100),
            ('Посвящение в студенты ВИ-ШРМИ', 500),
            ('Встреча фанатов Подслушки', 750),
            ('Выборы ректора', 20),
            ('День преподавателя', 240)
    '''
)

cursor.executescript (
    '''
        INSERT INTO role_event (role_id, event_id, role_amount)
        VALUES 
            (1, 1, 2),
            (1, 2, 1),
            (1, 7, 1),
            (1, 8, 2),
            (2, 1, 1),
            (2, 2, 2),
            (2, 3, 2),
            (2, 4, 1),
            (2, 5, 1),
            (2, 6, 1),
            (2, 7, 2),
            (2, 8, 1),
            (2, 9, 1),
            (2, 10, 1),
            (3, 3, 5),
            (4, 2, 1),
            (4, 3, 3),
            (4, 4, 1),
            (4, 8, 2),
            (4, 10, 1),
            (5, 1, 1),
            (5, 2, 1),
            (5, 3, 1),
            (5, 4, 1),
            (5, 5, 1),
            (5, 6, 1),
            (5, 7, 1),
            (5, 8, 1),
            (5, 9, 1),
            (5, 10, 1)
    '''
)

cursor.executescript (
    '''
        UPDATE event_workers
        SET
            worker_id = '89140000005' 
        WHERE
            role_event_id IN (21, 22, 23, 29, 30);

        UPDATE event_workers
        SET
            worker_id = '89140000010'
        WHERE
            role_event_id IN (24, 25, 26, 27, 28)
    '''
)

cursor.executescript (
    '''
        INSERT INTO schedule (event_date, event_id)
        VALUES 
            ('2024-03-01', 1),
            ('2024-03-02', 2),
            ('2024-03-03', 3),
            ('2024-03-04', 4),
            ('2024-03-05', 5),
            ('2024-03-06', 6),
            ('2024-03-07', 7),
            ('2024-03-08', 8),
            ('2024-03-09', 9),
            ('2024-03-10', 10)
    '''
)

cursor.executescript (
    '''
        INSERT INTO room_schedule (room_id, schedule_id)
        VALUES 
            (1, 1),
            (9, 2),
            (5, 2),
            (1, 2),
            (9, 3),
            (6, 4),
            (4, 4),
            (6, 5),
            (1, 6),
            (6, 7),
            (6, 8),
            (4, 9),
            (5, 10)
    '''
)

conn.commit()
conn.close()